IDENTIFICATION DIVISION.
PROGRAM-ID. Name-countdown.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 UserName PIC X(20) VALUE SPACES.
01 UserNumber PIC 9 VALUE 3.
01 Counter PIC 9.

PROCEDURE DIVISION.
Main-Logic.
DISPLAY "Enter your name: " WITH NO ADVANCING
ACCEPT UserName

DISPLAY "Enter a starting number: " WITH NO ADVANCING
ACCEPT UserNumber

PERFORM VARYING counter FROM UserNumber BY -1 UNTIL counter = ZERO
	DISPLAY Counter
END-PERFORM

DISPLAY UserName.
